"""
Задача 1

Напишите класс
Rectangle
 с атрибутами длины и ширины.

Создайте метод
perimeter()
 для вычисления периметра прямоугольника и метод
area()
 для вычисления площади прямоугольника.

Создайте метод
display()
, который отображает длину, ширину, периметр и площадь экземпляра класса
Rectangle
.

Задача 2

Создайте класс
Person
, содержащий два атрибута: имя и возраст.

Создайте метод класса
fromBirthYear
 с альтернативным способом создания экземпляра класса
Person
 — когда указан год рождения.

person = Person('Иван', 19)
person.display()

person1 = Person.fromBirthYear('Николай',  2000)
person1.display()

# вывод
Это Иван, ему 19
Это Николай, ему 23
"""